app/Controllers/Courses.php

    public function index()
    {
        $produk = $this->produkModel->findAll(); // ambil semua produk dari DB

        $data = [
            'title'  => 'Daftar Kursus',
            'produk' => $this->produkModel->findAll()
---
SELECT *
FROM `produk`