app/Controllers/Home.php

    public function ceklogin()
    {
        //tangkap varabel yang dikirim dari form login username dan password
        $session = session();
        $username = $this->request->getVar('username'); // ambil data username di database
        $password = $this->request->getVar('password'); // Get password from input

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'Admin'
 LIMIT 1

            'gambar' => $gambarName
        ];

        if ($produkModel->insert($insert)) {
---
INSERT INTO `produk` (`title`, `benefit`, `about`, `harga`, `durasi`, `gambar`) VALUES ('CPNS', 'Mengerti dalam negerjakan soal cpns1', '..', 'IDR 250000', '40', '1748796500_f913f05c6b1ca6b1e41b.png')