app/Controllers/KelolaUser.php

    public function index()
    {
        $session = session();
        if (!$session->get('login') || $session->get('role') !== 'Admin') {
            return redirect()->to(base_url('/'))->with('message', 'Anda tidak memiliki akses.');
        }

        $userModel = new UserModel();
        $siswa = $userModel->where('role', 'Siswa')->findAll();
---
SELECT *
FROM `user`
WHERE `role` = 'Siswa'