app/Controllers/LaporanUserController.php

SELECT *
FROM `user`
---
    public function cetakPdf()
    {
        $userModel = new \App\Models\UserModel();
        $data['users'] = $userModel->findAll(); // ambil semua user