app/Models/LaporanUserModel.php

SELECT `user`.`username`, `produk`.`title` AS `kursus`, `pembayaran`.`status`, `pembayaran`.`created_at`
FROM `pembayaran`
JOIN `user` ON `user`.`user_id` = `pembayaran`.`user_id`
JOIN `produk` ON `produk`.`id_produk` = `pembayaran`.`id_produk`
ORDER BY `pembayaran`.`created_at` DESC
---
    public function getLaporanPembayaranUser()
    {
        return $this->db->table('pembayaran')
            ->select('user.username, produk.title AS kursus, pembayaran.status, pembayaran.created_at')
            ->join('user', 'user.user_id = pembayaran.user_id')
            ->join('produk', 'produk.id_produk = pembayaran.id_produk')
            ->orderBy('pembayaran.created_at', 'DESC')
            ->get()
            ->getResult();