app/Models/NilaiModel.php

SELECT `nilai`.*, `user`.`full_name`, `pengaturan`.`nama_ujian`
FROM `nilai`
JOIN `user` ON `user`.`user_id` = `nilai`.`user_id`
JOIN `pengaturan` ON `pengaturan`.`id_pengaturan` = `nilai`.`id_pengaturan`
ORDER BY `nilai`.`tanggal` DESC
---
    public function getLaporanNilai()
    {
        return $this->db->table('nilai')
            ->select('nilai.*, user.full_name, pengaturan.nama_ujian')
            ->join('user', 'user.user_id = nilai.user_id')
            ->join('pengaturan', 'pengaturan.id_pengaturan = nilai.id_pengaturan')
            ->orderBy('nilai.tanggal', 'DESC')
            ->get()
            ->getResult();