app/Models/PembayaranModel.php

    public function getLaporanPenjualan()
    {
        return $this->select('produk.title AS produk_nama')
            ->selectCount("CASE WHEN pembayaran.status = 'paid' THEN 1 ELSE NULL END", 'jumlah_paid', false)
            ->selectCount("CASE WHEN pembayaran.status = 'pending' THEN 1 ELSE NULL END", 'jumlah_pending', false)
            ->join('produk', 'produk.id_produk = pembayaran.id_produk')
            ->groupBy('pembayaran.id_produk, produk.title')
            ->findAll();
---
SELECT `produk`.`title` AS `produk_nama`, COUNT(CASE WHEN pembayaran.status = 'paid' THEN 1 ELSE NULL END) AS `jumlah_paid`, COUNT(CASE WHEN pembayaran.status = 'pending' THEN 1 ELSE NULL END) AS `jumlah_pending`
FROM `pembayaran`
JOIN `produk` ON `produk`.`id_produk` = `pembayaran`.`id_produk`
GROUP BY `pembayaran`.`id_produk`, `produk`.`title`

    public function getLaporanPembayaranBerhasil()
    {
        return $this->select('user.full_name AS nama_user, produk.title AS nama_kursus, pembayaran.harga, pembayaran.created_at')
            ->join('user', 'user.user_id = pembayaran.user_id')
            ->join('produk', 'produk.id_produk = pembayaran.id_produk')
            ->where('pembayaran.status', 'paid')
            ->orderBy('pembayaran.created_at', 'DESC')
            ->findAll();
---
SELECT `user`.`full_name` AS `nama_user`, `produk`.`title` AS `nama_kursus`, `pembayaran`.`harga`, `pembayaran`.`created_at`
FROM `pembayaran`
JOIN `user` ON `user`.`user_id` = `pembayaran`.`user_id`
JOIN `produk` ON `produk`.`id_produk` = `pembayaran`.`id_produk`
WHERE `pembayaran`.`status` = 'paid'
ORDER BY `pembayaran`.`created_at` DESC